tutorials/crysImpurityPBEFoam/shearIlievski3L2z/constant/populationBalanceProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object populationBalanceProperties;
}

populationBalanceModel crysImpurityPopulationBalance;

crysImpurityPopulationBalanceCoeffs
{
    rhop        2666;
    shapeFactor 0.523598775598;
    sizeRef     1.0e-4;

    speciesCoupled true;
    nucleation      true;
    growth          true;
    aggregation     true;
    breakup         false;

    saturationModel
    {
        solutionSaturationModel K2SO4H2O;
    }

    diffusionModel
    {
        diffusionModel none;
    }

    aggregationKernel
    {
        aggregationKernel constant;
        Ca Ca [0 0 -1 0 0 0 0] 1.0e-13;
    }

    growthModel
    {
        growthModel coolCrysSizeEffectGrowth;
        minAbscissa 1.0e-9;
        maxAbscissa 2.0e-3;
        CgGrowth CgGrowth [0 1 -1 0 0 0 0] 9.0e-5;
        powCoeff 1.95;
        Lc Lc [0 0 1 0 0 0 0] 4.0e-4;
        qSize 4;
    }

    nucleationModel
    {
        nucleationModel areaNucleation;
        kb kb [0 -3 -1 0 0 0 0] 5.6e7;
        b 3;
        alpha 2;
        momentGroup populationBalance;
        d_nucleation 1.0e-6;
    }

    impurityCoeffs
    {
        impurityAdsorptionModel competitiveAdsorption;
        soluteField C;
        impurityField Ci;
        Ki Ki [-1 3 0 0 0 0 0] 0.5;
        Ks Ks [-1 3 0 0 0 0 0] 0.01;
        eta 0.01;
        rhoi 1200;
        surfaceFactor 3.14159265359;
        zNucleation 0;
    }

    Pr 7;
    Prt 0.85;
    molarDiff 1.0e-9;
    Sct 0.7;

    odeCoeffs
    {
        solveSources true;
        solveOde true;
        ATol 1.0e-10;
        RTol 1.0e-6;
        fac 0.9;
        facMin 0.2;
        facMax 2;
        minLocalDt 1.0e-10;
    }
}
